DataProcessors/АвтозаведениеУпаковкиПоШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АвтозаведениеУпаковкиПоШК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПризнакиУпаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИспользованияУпаковки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеМинус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВесТоварПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Допуск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеЗакупочныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступностьТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ДоступностьТоваровНаСкладах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпецификацииПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СпецификацииПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Спецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураСырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПокупнойТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализуемаяУслуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС13</Name>
					<Comment>(Общ) Ставка НДС 13%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС13_113</Name>
					<Comment>(Общ) Расчетная ставка НДС 13% / 113%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСкладируемостиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыСкладируемостиТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Складируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нескладируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладируемыйДоЗаказа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЕдиницыИзмерения</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатурныеГруппы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПоКлассификатору</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьОНецелыхМестах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АвтозаведениеУпаковкиПоШК/Forms/Форма/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьПоставщикаПоЦенам(мДата, мНоменклатура, мХарактеристика)
	
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"			, мДата);
	Запрос.УстановитьПараметр("Номенклатура"	, мНоменклатура);
	Запрос.УстановитьПараметр("Характеристика"	, мХарактеристика);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныПоставщиковСрезПоследних.Поставщик
	|ИЗ
	|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(&Дата, Номенклатура = &Номенклатура И Характеристика = &Характеристика) КАК ЦеныПоставщиковСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Поставщик;
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция НайтиУпаковку()
	
	МасУпак = Новый Массив;
	
	мТекстПоиска = СокрЛП(СтрЗаменить(Объект.НаименованиеУпаковки, Объект.ПризнакУпаковки.Наименование, ""));
	Если ЗначениеЗаполнено(мТекстПоиска) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Наименование", "%" + мТекстПоиска + "%");
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование ПОДОБНО &Наименование
		|	И Номенклатура.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТоваров.Упаковка)
		|	И НЕ Номенклатура.ПометкаУдаления";
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл
			МасУпак.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
    Возврат МасУпак;	

КонецФункции // ()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.НормаРасхода 					= 1;
	Объект.ДатаНачалаИспользованияУпаковки 	= ТекущаяДата() + 7*86400;
	
КонецПроцедуры


Процедура СформироватьНаименование()
	
	Если ЗначениеЗаполнено(Объект.ШК)
			И ЗначениеЗаполнено(Объект.ПризнакУпаковки) Тогда
			
		СтруктураДанных = ВнешниеДанные.СчитатьДанныеПоШтрихКоду(Объект.ШК);
		
		Объект.НаименованиеУпаковки	= "";
		НоменклатураШК 		= СтруктураДанных.Номенклатура;
		ХарактеристикаШК 	= СтруктураДанных.Характеристика;
		Если НЕ ЗначениеЗаполнено(НоменклатураШК) Тогда
			Сообщить("По штрих-коду не найдена номенклатура");
			Возврат;
		КонецЕсли; 
		
		//
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Номенклатура"	, НоменклатураШК);
		Запрос.УстановитьПараметр("Характеристика"	, ХарактеристикаШК);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныПоставщиковСрезПоследних.Поставщик
		|ИЗ
		|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика) КАК ЦеныПоставщиковСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.НаименованиеУпаковки = Объект.ПризнакУпаковки.Наименование + " " + НоменклатураШК + " " + Выборка.Поставщик;
		Иначе
			Сообщить("Не найден поставщик");
		КонецЕсли;

		Объект.Номенклатура 	= НоменклатураШК;
		Объект.Характеристика 	= ХарактеристикаШК;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	
	Объект.Номенклатура 	= Неопределено;
	Объект.Характеристика 	= Неопределено;
	
	//
	СформироватьНаименование();
	
КонецПроцедуры


&НаКлиенте
Процедура ПризнакУпаковкиПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры


Процедура СоздатьЭлементСправочникаСервер()
	
	//
	Эл = Справочники.Номенклатура.НайтиПоНаименованию(Объект.НаименованиеУпаковки);
	Если ЗначениеЗаполнено(Эл) Тогда
		Сообщить("Уже есть такой элемент номенклатуры");
		Возврат;
	КонецЕсли;

	//
	НовыйОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	НовыйОбъект.Наименование			= Объект.НаименованиеУпаковки;
	НовыйОбъект.НаименованиеПолное		= Объект.НаименованиеУпаковки;
	НовыйОбъект.Родитель				= Объект.ПризнакУпаковки.ТоварнаяГруппа;
	//НовыйОбъект.Родитель				= Справочники.Номенклатура.НайтиПоКоду("000000398");
	НовыйОбъект.ТипТовара				= Перечисления.ТипыТоваров.Упаковка;
	НовыйОбъект.НеВедетсяУчетПоХарактеристикам = Истина;
	НовыйОбъект.ВидНоменклатуры			= Перечисления.ВидыНоменклатуры.Товар;
	НовыйОбъект.СтавкаНДС				= Перечисления.СтавкиНДС.НДС18;
	НовыйОбъект.БазоваяЕдиницаИзмерения	= Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
	НовыйОбъект.ГруппаНоменклатурыУРЗ	= Справочники.ГруппыНоменклатурыУРЗ.НайтиПоНаименованию("Этикетка");
	НовыйОбъект.Складируемая			= Истина;
	НовыйОбъект.ВидСкладируемости		= Перечисления.ВидыСкладируемостиТовара.Складируемый;
	
	//+++АК KIRN 2018.03.22 ИП-00018215
	НовыйОбъект.ТорговаяМарка 			= Объект.Номенклатура.ТорговаяМарка;
	//---АК KIRN 
	
	НовыйОбъект.Записать();
	
	НовЕд = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
	НовЕд.Владелец		= НовыйОбъект.Ссылка;
	НовЕд.Наименование	= Объект.ЕдиницаХраненияОстатков;
	Если Объект.ЕдиницаХраненияОстатков = "Шт" Тогда
		НовЕд.Вес						= 0.001;
		НовЕд.ЕдиницаПоКлассификатору	= Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
		НовЕд.Коэффициент				= 1;
	Иначе	
		НовЕд.Вес						= 1;
		НовЕд.ЕдиницаПоКлассификатору	= Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("кг");
		НовЕд.Коэффициент				= 1;
	КонецЕсли; 
	НовЕд.Записать();
	
	НовыйОбъект.ЕдиницаХраненияОстатков = НовЕд.Ссылка;
	НовыйОбъект.Записать();
	
	//
	МенеджерЗаписи = РегистрыСведений.ДоступностьТоваровНаСкладах.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СтруктурнаяЕдиница	= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("P00000231");
	МенеджерЗаписи.Склад				= Справочники.Склады.НайтиПоКоду("000000302");
	МенеджерЗаписи.Номенклатура			= НовыйОбъект.Ссылка;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.ДоступностьТоваровНаСкладах.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.СтруктурнаяЕдиница	= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("P00000243");
	МенеджерЗаписи.Склад				= Справочники.Склады.НайтиПоКоду("000000292");
	МенеджерЗаписи.Номенклатура			= НовыйОбъект.Ссылка;
	
	//
	МенеджерЗаписи = РегистрыСведений.СпецификацииПоставщиков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период				= Объект.ДатаНачалаИспользованияУпаковки;
	МенеджерЗаписи.Поставщик			= ПолучитьПоставщикаПоЦенам(Объект.ДатаНачалаИспользованияУпаковки, Объект.Номенклатура, Объект.Характеристика);
	МенеджерЗаписи.Номенклатура			= Объект.Номенклатура;
	МенеджерЗаписи.Характеристика		= Объект.Характеристика;
	МенеджерЗаписи.НоменклатураСырье	= НовыйОбъект.Ссылка;
	МенеджерЗаписи.Количество			= Объект.НормаРасхода;
	МенеджерЗаписи.ЕдиницаИзмерения		= НовЕд.Ссылка;
	МенеджерЗаписи.Записать();
	
	//
	Сообщить("Создан " + Объект.НаименованиеУпаковки);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлементСправочника(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПризнакУпаковки) Тогда
		Сообщить("Выберите признак упаковки");
		Возврат;
	КонецЕсли; 
	
	//
	МасУпак = НайтиУпаковку();	
	Если МасУпак.Количество() > 0 Тогда
		Сообщение = "Обнаружена упаковка у данной позиции";
		Для каждого ЭлементМассива Из МасУпак Цикл
			Сообщение = Сообщение + "
			|" + Строка(ЭлементМассива);
		КонецЦикла; 
		Сообщение = Сообщение + "
		|Продолжить?";
		Если Вопрос(Сообщение,РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;	
		КонецЕсли; 	
	КонецЕсли; 	
	Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаХраненияОстатков) Тогда
		Сообщить("Выберите единицу хранения");
		Возврат;
	КонецЕсли;
	
	//
	Если ЗначениеЗаполнено(СокрЛП(Объект.НаименованиеУпаковки)) Тогда
		СоздатьЭлементСправочникаСервер();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаИспользованияУпаковкиПриИзменении(Элемент)
	
	Если Объект.ДатаНачалаИспользованияУпаковки < НачалоДня(ТекущаяДата()) Тогда
		Объект.ДатаНачалаИспользованияУпаковки = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры
